<?php
/* @var $this SiteController */
/* @var $error array */

$this->pageTitle=Yii::app()->name . ' - Error';
?>

<h2>އެރަރ <?php echo $code; ?></h2>

<div class="error">
  <p><strong><?=CHtml::tag('span',['style'=>'color:red'], $code == 403 ?
        "އެދިލެއްވި ޚިދުމަތް ބޭނުންކުރެއްވުމުގެ ހުއްދައެއް ނެތް.":
        ($code==404?"އެދިލެއްވި ޚިދުމަތެއް މިޕޯޓަލްގައި ޤާއިމް ކުރެވިފައެއް
        ނެތް": "ސަރވަރގައި މައްސަލައެއް
        ދިމާވެގެން އެމައްސަލަ ލޮގް
        ކުރެވިއްޖެ. ވީ
        އެންމެ އަވަހަކަށް މައްސަލަ ޙައްލު ކުރެވޭނެ."))
      ?></strong></p>
  <p>މިކަމުގައި އަވަސް ޙައްލެއް ހޯއްދެވުމަށް އަޅުގަނޑުމެންގެ ރަސްމީ އޮފީހާއި
    ގުޅުއްވާ.</p>
</div>