<?php
/* @var $this UsersController */
/* @var $form CActiveForm */

?>

  <h3>މޯލްޑިވްސް ޙައްޖު ކޯޕަރޭޝަން ލިމިޓެޑްގެ ފަހެލި ޕޯޓަލް އަށް މަރުޙަބާ</h3>


<?php
$form = $this->beginWidget('CActiveForm', array(
  'id' => 'user-agreement-form',
  // Please note: When you enable ajax validation, make sure the corresponding
  // controller action is handling ajax validation correctly.
  // There is a call to performAjaxValidation() commented in generated controller code.
  // See class documentation of CActiveForm for details on this.
  'enableAjaxValidation' => false,
));
$person = new Persons();
$person->agreed_to_terms_of_use = 1;
?>

  <div class="panel panel-success">
    <div class="panel-heading">ފަހެލި ޕޯޓަލް ބޭނުންކުރެއްވުމުގެ އުސޫލު</div>
    <div class="panel-body" style="padding: 50px;letter-spacing: 1px">
      <p>މޯލްޑިވްސް ޙައްޖު ކޯޕަރޭޝަން ލިމިޓެޑްގެ ފަހެލި ޕޯޓަލް އަށް މަރުޙަބާ.
        މި ޕޯޓަލް ބޭނުންކުރެއްވުމުގެ ކުރިން މިޕޯޓަލް ބޭނުންކުރެއްވުމުގެ
        އުޞޫލުތައް
        ވިދާޅުވެ، މި އުޞޫލުތަކުގައިވާ ނުކުތާތަކަށް އެއްބަސް ވެލައްވާށެވެ.
      </p>

      <h3>ޕޯޓަލް ބޭނުންކުރެއްވުން</h3>
      <ul>
        <li>މި ޕޯޓަލްގައިވާ އެންމެހާ މަޢުލޫމާތަކީ މި ކޯޕަރޭޝަންގެ
          ޙައްގެކެވެ.
        </li>
        <li>މި ޕޯޓަލްގައިވާ މަޢުލޫމާތުތަކުގެ ތެރޭގައި ހިމެނޭ ތިޔަ ފަރާތުގެ އަމިއްލަ މަޢުލޫމާތު ފިޔަވާ، މި ކޯޕަރޭޝަނުން ޢާއްމުކޮށްފައިނުވާ އެއްވެސް  މަޢުލޫމާތެއް 3 ވަނަ ފަރާތަކާއި ޙިއްސާ ކުރައްވަންވާނީ، މި ކޯޕަރޭޝަންގެ ހުއްދަ ލިޔުމަކުން ލިބިގެންނެވެ.
        </li>
        <li>މި ޕޯޓަލް އަށް ލޮގިން ކުރެއްވުމަށް ބޭނުންކުރައްވާ ފޯނު ނަމްބަރާއި ވެރިފިކޭޝަން ކޯޑު
          އެހެން ފަރާތަކާ ޙިއްޞާ ކުރެއްވުމުން ކުރިމަތިވާ އެއްވެސް ޙާލަތަކަށް މި
          ކޯޕަރޭޝަނުން ޒިންމާ ނުވާނެއެވެ.
        </li>
        <li>
          މި ޕޯޓަލް މެދުވެރިކޮށް، މި ކޯޕަރޭޝަންއާއި، ތިޔަފަރާތާއި ދެމެދު
          ކުރެވޭ އެންމެހާ
          މުޢާމަލާތްތަކަކީ އޯޑިޓް ޤަވާޢިދުގެ ދަށުން ލޮގް ކުރެވި، ރެކޯޑު
          ކުރެވެމުންދާ މުޢާމަލާތު ތަކެކެވެ. އެހެންކަމުން، މިޕޯޓަލް މެދުވެރިކޮށް
          އެއްވެސް
          މުޢާމަލާތެއް ކުރައްވަންވާނީ، އެކަމަށް އެއްބަސް ވެލައްވާ ނަމައެވެ.
          އަދި ފުރިހަމަ ރަނގަޅު މަޢުލޫމާތު ބޭނުންކުރެއްވުމަށް މިކޯޕަރޭޝަނުން
          އިލްތިމާސް ކުރަމެވެ.
        </li>
      </ul>
      <h3>ފައިސާގެ މުޢާމަލާތްތައް</h3>
      <ul>
        <li>
          މި ޕޯޓަލްގައި ކުރެވޭ އެންމެހާ ފައިސާގެ މުޢާމަލާތްތައް ކުރެވޭނީ ދިވެހި ރުފިޔާއިންނެވެ.  ފައިސާ ދައްކަވާ ކާޑަކީ ދިވެހި ރުފިޔާ ނޫން ފައިސާއެއްގެ  ކާޑެއް ކަމުގައި ވިޔަސް، މި ކޯޕަރޭޝަނަށް ޖަމާވާނީ ދިވެހިރުފިޔާ އެވެ.        </li>
        <li>
          މި ކޯޕަރޭޝަނަށް ދައްކަވާ ފައިސާ އަނބުރާ ރައްދު ކުރެވޭނީ އެއިރެއްގައި
          މިކޯޕަރޭޝަނުން ކަނޑައަޅާފައިވާ އުޞޫލުތަކުގެ މަތިން، އިދާރީ ފީ ނުވަތަ
          އެޑްމިނިސްޓްރޭޓިވް ޚަރަދަށްވާ ފައިސާ ކެނޑުމަށް ފަހުގައެވެ.
        </li>
        <li>
          މި ޕޯޓަލް މެދުވެރިކޮށް ފައިސާ ދައްކަވާ ކާޑަކީ ޞައްޙަ ޑެބިޓް ކާޑަކަށް ވާންވާނެއެވެ.
        </li>
        <li>

          މި ޕޯޓަލް މެދުވެރިކޮށް ފައިސާ
          ދެއްކެވުމުގެ ޚިދުމަތް ނުދިނުމުގެ ޙައްޤު މި ކޯޕަރޭޝަނަށް
          ލިބިގެންވެއެވެ.
        </li>
        <li>
          މި ޕޯޓަލް މެދުވެރިކޮށް ފައިސާ ދައްކަވާ އިރު ތިޔަފަރާތުން ދެއްވާ މަޢުލޫމާތަކީ ޞައްޙަ
          މަޢުލޫމާތުކަން ޔަގީން ކުރެއްވުމުގެ ޒިންމާ ތިޔަ ފަރާތުން އުފުއްލަވަން
          ވާނެއެވެ. އަދި ބޭނުންކުރައްވާ ކާޑަކީ ތިޔަފަރާތުން ފައިސާގެ މުޢާމަލާތު
          ކުރުމަށް ހުއްދައޮތް ކާޑެއްކަމުގެ ޒިންމާވެސް އުފުއްލަވަން ވާނެއެވެ.
        </li>
        <li>
          ފައިސާ ދެއްކެވުމަށް މެދުވެރިވާނީ އިންޓަނެޓްގެ ޒަރިއްޔާއިން ސެކިއޯ
          ސޮކެޓް ލޭޔަރ (އެސް. އެސް. އެލް.) ގެ ރައްކާތެރިކަމާއެކު، ފައިސާ
          ދެއްކުމަށް ބޭނުންކުރެވޭ ބޭންކުގެ ޕޭމަންޓް ގޭޓްވޭ
          އެވެ. ފައިސާ ދެއްކެވުމަށް ތިޔަފަރާތުން ބޭނުންކުރައްވާ ކާޑުގައި ހިމެނޭ އެއްވެސް މަޢުލޫމާތެއް
          މިކޯޕަރޭޝަނަށް އަދި މިޕޯޓަލް އަކަށްވެސް ނުލިބޭނެއެވެ.
        </li>
        <li>
          މި ޕޯޓަލް މެދުވެރިކޮށް ދައްކަވާ ފައިސާ އާއި، އެހެނިހެން ވަޞީލަތްތައް ބޭނުންކުރައްވައިގެން ދައްކަވާ ފައިސާ އާއި، ސީދާ ކޯޕަރޭޝަންގެ އޮފީހަށް ދައްކަވާ ފައިސާއާ ބެހޭ
          މަޢުލޫމާތާއި، ތިޔަފަރާތާއި މިކޯޕަރޭޝަނާ ދެމެދު ކުރެވޭ އެންމެހާ
          މުޢާމަލާތްތަކަކީ ސިއްރު މުޢާމަލާތްތަކެކެވެ. ޤާނޫނީ އަދި އުޞޫލީ ބޭނުމަށް ފިޔަވާ،
          އެހެން  އެއްވެސް ބޭނުމަކަށް މިއިން އެއްވެސް މަޢުލޫމާތެއް އެހެން ފަރާތަކާއި
          ޙިއްޞާ އެއް ނުކުރެވޭނެއެވެ.
        </li>
        <li>
          ފައިސާގެ އެންމެހާ މުޢާމަލާތްތަކަކީ ފައިސާ ދައްކަވާފަރާތުން ރަނގަޅަށް
          ރެކޯޑުކޮށްގެން ބަލަހައްޓަވަންވާނޭ މުޢާމަލާތްތަކެވެ. ތިޔަފރާތުން،
          މިޕޯޓަލް މެދުވެރިކޮށް ކުރައްވާ އެންމެހާ ފައިސާގެ މުޢާމަލާތްތައް
          ރެކޯޑުކޮށް ބެލެހެއްޓެވުމަށް މިކޯޕަރޭޝަނުން އިލްތިމާސް ކުރަމެވެ.
        </li>
      </ul>
      <p></p>

      <p><strong>
          މަތީގައި ދެންނެވުނު އެންމެހާ ނުކުތާތައް ރަނގަޅަށް ވިދާޅުވެ، އެއްބަސް ވެލެއްވުމަށް ތިރީގައި އެވާ "އަހުރެން އެއްބަސްވަން" ލިޔެފައިވާ ފިތަށް އޮއްބަވާ ލައްވާށެވެ.
          އެއަށް އެއްބަސްވެނުލައްވާނަމަ، މި ޕޯޓަލް ބޭނުމެއް ނުކުރެވޭނެއެވެ.

        </strong></p>

      <p>ޝުކުރިއްޔާ</p>

      <p>މޯލްޑިވްސް ޙައްޖު ކޯޕަރޭޝަން ލިމިޓެޑް</p>

    </div>
    <div class="panel-heading">
      <div class="row">
        <div class="col-md-2 col-md-offset-5 text-center">
          <?=$form->hiddenField($person, 'agreed_to_terms_of_use')?>
          <button class="btn btn-sm btn-primary"><H4>އަހުރެން
              އެއްބަސްވަން</H4></button>
        </div>
      </div>
    </div>
  </div>
<?php
$this->endWidget();
