<?php
return [
  // Alerts
  'hajjRegistrationReceivedText' => ' ge Hajj Registration registration form MHCL ah libijje. '
    . ' Formaai liyekiyun check'
    . ' kurumaffahu MHCL in message eh fonuvaane eve. 24 gadi-irah vure'
    . ' lasvejje nama, ofees hulhuvifai hunna gadi eggai'
    . ' gulhuvvun edhemeve. MHCL',
  'registerForHajj' => 'ޙައްޖަށް ރަޖިސްޓްރީ ކުރުން',
  'registrationSubmittedAlert' => ' ގެ ޙައްޖު ރަޖިސްޓްރީ ފޯމް
      އަޅުގަނޑުމެންނަށް ވަނީ ލިބިފައެވެ. ފޯމާއި ލިޔެކިޔުން ޗެކް ކުރުމަށްފަހު
      އެޕްރޫވް ވުމުން، ނޫނީ އިތުރު މަޢުލޫމާތު އޮޅުންފިލުވަން ތިޔަފަރާތާއި
      އަޅުގަނޑުމެން ގުޅާނަމެވެ. 24 ގަޑި އިރު ތެރޭ ޖަވާބެއް
      ނުލިބިއްޖެނަމަ ރަސްމީ ގަޑީގައި އަޅުގަނޑުމެންނާއި ގުޅުއްވާށެވެ',

  // Hajj Account View
  'hajjAccountDetails' => 'ޙައްޖު އެކައުންޓް ތަފްޞީލް',
  'balance' => 'ޖަމާކުރެވިފައިވާ ޢަދަދު',
  'currencySymbol' => 'ރ',
  'direction' => 'rtl',
  'hajjPrice' => 'ޙައްޖުގެ އަގު',
  'position' => 'ޖާގަ',
  'position {position} {year}' => 'year އަހަރުގެ position ވަނަ',
  'placementInfo {amt}' => 'ޖާގަ ލިބޭނީ amt ޖަމާވުމުން',
  'payOnline' => 'އޮންލައިންކޮށް ފައިސާ ދައްކަވާ',
  'onlinePayment' => 'އޮންލައިންކޮށް ފައިސާ ދެއްކެވުން',
  'temporarilyDown' => 'މިވަގުތު އޮންލައިންކޮށް ފައިސާ ދެއްކޭކަށް ނެތް',
  'confirmSlot' => ' (ޖާގަ ލިބުމަށް)',
  'fullPayment' => ' (އަގު ހަމަވުމަށް)',
  'anotherAmount' => 'އެހެން ޢަދަދެއް',
  'enterAnotherAmount' => 'ޢަދަދެއް ޖައްސަވާ',
  'depositAmount' => 'ޖަމާކުރެވޭ ޢަދަދު',
  'payAboveAmount' => 'މަތީގައިވާ ޢަދަދަށް ފައިސާ ދައްކަވާ',
  'paymentNote' => 'ނޯޓު: މިޕޯޓަލް މެދުވެރިކޮށް ފައިސާ ދެއްކެވުމުގެ ކުރިން، '
    . CHtml::link('ޕޯޓަލް
      ބޭނުންކުރެއްވުމުގެ އުޞޫލު',Yii::app()->createUrl('users/userAgreement')
        ,['style' => 'text-decoration: underline']).
      ' ވިދާޅުވާށެވެ. ފައިސާ ދެއްކެވުމުގެ ކުރިން
      މިއުޞޫލުތައް ވިދާޅުވެ އެއަށް އެއްބަސްވެލައްވާށެވެ.
      އެހެންނޫންނަމަ
      މިޚިދުމަތް ބޭނުން ނުކުރައްވާށެވެ. ބެންކް
      މެދުވެރިކޮށް އޮންލައިންކޮށް ފައިސާ ދެއްކޭ ގޮތް ހެދިފައި މިވަނީ،
      ފައިސާ ދައްކަވާ ފަރާތް މިދެއްނެވުނު އުޞޫލުތަކަށް
      އެއްބަސްވެލައްވާ
      ގޮތަށެވެ.',
  'forwardedToBankModal' => 'ފައިސާ ދައްކަވަން ބޭންކް ގޭޓްވޭ އަށް ފޯވާޑް ކުރެވެނީ',
  'forwardedToBankInfo' => 'ފައިސާ ދެއްކުމުގެ މުޢާމަލާތް ނިމުމުން އަނބުރާ މި ޞަފްޙާ އަށް ބަދަލު
        ވާނެއެވެ. މުޢާމަލާތް ނިމެންދެން ބްރައުޒަރ ގެ ބެކް ބަޓަން އާއި ރެފރެޝް
        ބަޓަން ބޭނުން ނުކުރައްވާށެވެ.',
  'cancelBtn' => 'ކެންސަލް',
  'bmlGateway' => 'ބެންކް އޮފް މޯލްޑިވްސް ގޭޓްވޭ',
  'declinedMsg' => 'ކާޑު ޤަބޫލެއް ނުކުރި. އެހެން
          ކާޑެއް ބޭނުންކުރައްވައިގެން އަލުން މަސައްކަތް ކޮށްލައްވާ.',
  'gatewayError' => 'ގޭޓްވޭ މެދުވެރިކޮށް ޚިދުމަތް
          ދިނުމުގައި މައްސލައެއް ކުރިމަތިވެއްޖެ. ވީ އެންމެ އަވަހަކަށް
          މިމައްސަލަ ޙައްލު ކުރެވޭނެ. އިރުކޮޅެއް ފަހުން މަސައްކަތް ކޮށްލައްވާ.',
  'paymentSuccess {amt} {msg}' => 'އޮންލައިންކޮށް amt ދެއްކެވިއްޖެ. ޝުކުރިއްޔާ. msg',
  'slotMsg' => "ލިބިފައިވާ ޖާގަ ފެންނަން 15 މިނިޓް ނަގާފާނެއެވެ.",

  // Hajj Registration View
  'contactInfo' => 'ގުޅޭނޭ ގޮތް',
  'nokFamilyPhone' => 'ވާރުތަވެރިޔާ، ޢާއިލާ ގެ ފޯނު',
  'emergencyContactInfo' => 'ކުއްލި ޙާލަތުގައި ގުޅާނޭ ފަރާތް',
  'emergencyNamePhone' => 'ނަމާއި ފޯނު',
  'emergencyPhone' => 'އެމަޖަންސީ ފޯނު',
  'emergencyPhonePlaceHolder' => 'އެމަޖަންސީ ފޯނު',
  'emergencyNamePlaceHolder' => 'ނަން',
  'hajjInfo' => 'ޙައްޖަށް ދިއުމާ ގުޅާ މަޢުލޫމާތު',
  'badhal_hajj' => 'ބަދަލު ޙައްޖަކަށް؟',
  'group_name' => 'ގްރޫޕް ލީޑަރުގެ އައި.ޑީ',
  'groupLeaderNote' => 'ގްރޫޕް ލީޑަރު ރަޖިސްޓްރީ ކުރެވިފައި ވާނަމަ، އޭނާއާ
            އެކުގައި ހުރުމާއި ދަތުރު ފަތުރު ހަމަޖައްސާ ދެވޭނެއެވެ. މިގުރޫޕުގައި އެހެން ބޭފުޅުން ހިމެނުމަށް، އެބޭފުޅުންގެ ފޯމު ފުރުއްވާއިރު ހަމަ މިލީޑަރުގެ އައި.ޑީ
          ޚިޔާރު ކުރައްވާށެވެ.',
  'application_form' => 'ޙައްޖަށް ރަޖިސްޓްރީ ވުމަށް އެދޭ ފޯމު',
  'mahram_document' => 'މަޙްރަމެއްކަން އަންގާދޭ ލިޔުން',
  'downloadFormInfo' =>
          'ހުސް ފޯމެއް ' . CHtml::link('ޑައުންލޯޑް',
            Constants::REGISTRATION_PDF, [
            'target' => '_blank', 'id' => 'applicationFormDownloadLink',
            'style' => 'text-decoration: underline']) .
          ' ކުރައްވާ، ފޯމު ފުރުއްވުމަށްފަހު މަތީގައި އެޓޭޗް ކުރައްވާށެވެ.',
  'mahramInfo' => 'ޢުމުރުން 45 އަހަރުން ދަށުގެ އަންހެން ބޭފުޅެއްނަމަ މި ކޯޕަރޭޝަނުގައި
          އެބޭފުޅެއްގެ މަޙްރަމް ރަޖިސްޓްރީ ކުރައްވަންވާނެއެވެ. އަދި އެފަރާތާ
          ހުރި ގުޅުން އަންގާދޭ ޤަނޫނީ ލިޔުން (އިނގިރޭސި ތަރުޖަމާ) މަތީގައި
          ހުށަހަޅުއްވަން ވާނެއެވެ. މި ލިޔުން ފަހުންވެސް (ޙައްޖަށް ދިއުމަށް
          ޖާގަ ލިބުމުން) ކޯޕަރޭޝަނާ ޙަވާލު
          ކުރެވިދާނެއެވެ.',


];
