<?php
return [
  'plannedTrips' => 'ކުރިޔަށް ރޭވިފައިވާ ޢުމްރާ ދަތުރުތައް',
  'registerFor {umra}' => 'umra އަށް ރެޖިސްޓަރ ކުރުން',
  'chooseMahram' => 'މަޙްރަމް އެއް ނަންގަވާ',

  // Form labels
  'mahramId' => 'މަޙްރަމްގެ އައި.ޑީ ނަމްބަރު',
  'mahramInfo' => 'ޢުމުރުން 45 އަހަރުން ދަށުގެ އަންހެން ބޭފުޅެއްނަމަ  އެބޭފުޅެއްގެ
          މަޙްރަމްވެސް މިޢުމްރާއަށް ރަޖިސްޓްރީ ކުރައްވަން ވާނެއެވެ. މަޙްރަމް
          ރަޖިސްޓްރީ ކުރެއްވުމަށްފަހު މަތީގައިވާ ގޮޅިން އެބޭފުޅެއް ނަންގަވާށެވެ.
          އަދި މަޙްރަމާ ހުރި ގުޅުން އަންގާދޭ ޤަނޫނީ ލިޔުން (އިނގިރޭސި
          ތަރުޖަމާ) ތިރީގައި އެޓޭޗް ކުރައްވަންވާނެއެވެ.',
  'mahramIdError' => 'މަޙްރަމް އައި.ޑީ ނަންބަރު
							ރަނގަޅެއްނޫން. މަޙްރަމް ފުރަތަމަ ރަޖިސްޓްރީ ކުރައްވާ',
  'mahramMaleRequired' => 'މަޙްރަމެއްގެ ގޮތުގައި ފިރިހެން
              ބޭފުޅެއްގެ އައި.ޑީ ޖައްސަވާ',
  'currentAddress' => 'މިހާރުގެ އެޑްރެސް',
  'current_island_id' => 'ރަށް',
  'current_address_english' => 'އެޑްރެސް (އިނގިރޭސިން)',
  'current_address_dhivehi' => 'އެޑްރެސް (ދިވެހިން)',
  'groupInfo' => 'ގްރޫޕެއްގެ ގޮތުގައި ރަޖިސްޓްރީ ކުރުން',
  'application_form' => 'ރަޖިސްޓްރީ ވުމަށް އެދޭ ފޯމް',
  'downloadFormInfo' => 'ހުސް ފޯމެއް ' .CHtml::link('ޑައުންލޯޑް',
    Constants::REGISTRATION_PDF, [
    'target' => '_blank', 'id' => 'applicationFormDownloadLink',
    'style' => 'text-decoration: underline'
  ]). 'ކުރައްވާ، ފޯމު ފުރުއްވުމަށްފަހު މަތީގައި އެޓޭޗް ކުރައްވާށެވެ.',

  // Umra Details
  'registeredInfo {fullName} {id_no} {tripName}' => 'fullName (id_no) ވަނީ
  tripName އަށް ރަޖިސްޓްރީ ކުރެވިފައެވެ.',
  'umraPrice' => 'ޢުމްރާގެ އަގު',
  'pastDeadline' => 'މުއްދަތު ހަމަވެފައި',
  'dates' => 'ތާރީޚްތައް',
  'departureDate' => 'ފުރާ ތާރީޚް',
  'arrivalDate' => 'އަންނަ ތާރީޚް',
  'deadlineDate' => 'މުއްދަތު ހަމަވާ ތާރީޚް',
  'discounts' => 'ޑިސްކައުންޓްތައް',
  'discountInfo' => 'ޑިސްކައުންޓަށް
            އެދިލެއްވުމަށް އަޅުގަނޑުމެންގެ އޮފީހަށް ގުޅުއްވާ (ގްރޫޕް
            ޑިސްކައުންޓް ހަމަޖެހޭނީ ގްރޫޕުގެ ހުރިހާ ބޭފުޅުން ރަޖިސްޓްރީ
            ކުރެއްވުމުންނެވެ.)',

  'emergencyContact' => 'ކުއްލި ޙާލަތުގައި ގުޅާނޭ ފަރާތް',
  'ec_island_id' => 'ރަށް',
  'ec_address_english' => 'އެޑްރެސް (އިނގިރޭސިން)',
  'ec_address_dhivehi' => 'އެޑްރެސް (ދިވެހިން)',
  'ec_full_name' => 'ނަން',
  'ec_phone_number' => 'އެޑްރެސް (ދިވެހިން)',
  
];
